```bash
=== RUN   TestGroundworkModule
TestGroundworkModule 2022-02-16T20:59:35-03:00 retry.go:91: terraform [init -upgrade=false]
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: Running command terraform with args [init -upgrade=false]
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: Initializing modules...
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: Initializing the backend...
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: Initializing provider plugins...
TestGroundworkModule 2022-02-16T20:59:35-03:00 logger.go:66: - Reusing previous version of hashicorp/oci from the dependency lock file
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: - Using previously-installed hashicorp/oci v4.63.0
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: Terraform has been successfully initialized!
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: You may now begin working with Terraform. Try running "terraform plan" to see
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: any changes that are required for your infrastructure. All Terraform commands
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: should now work.
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: If you ever set or change modules or backend configuration for Terraform,
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: rerun this command to reinitialize your working directory. If you forget, other
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: commands will detect it and remind you to do so if necessary.
TestGroundworkModule 2022-02-16T20:59:36-03:00 retry.go:91: terraform [apply -input=false -auto-approve -lock=false]
TestGroundworkModule 2022-02-16T20:59:36-03:00 logger.go:66: Running command terraform with args [apply -input=false -auto-approve -lock=false]
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + create
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: Terraform will perform the following actions:
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   # module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table will be created
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + resource "oci_core_default_route_table" "generated_oci_core_default_route_table" {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + compartment_id             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + defined_tags               = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + display_name               = "pub-routetable-01"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + freeform_tags              = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + id                         = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + manage_default_resource_id = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + state                      = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + time_created               = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + route_rules {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + cidr_block        = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + description       = "Tráfedo de/para internet"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + destination       = "0.0.0.0/0"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + destination_type  = "CIDR_BLOCK"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + network_entity_id = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:         }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   # module.groundwork.oci_core_internet_gateway.internet_gateway will be created
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + resource "oci_core_internet_gateway" "internet_gateway" {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + compartment_id = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + defined_tags   = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + display_name   = "MentoriaIaC-igw"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + enabled        = true
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + freeform_tags  = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + id             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + state          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + time_created   = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + vcn_id         = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   # module.groundwork.oci_core_subnet.subnet will be created
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + resource "oci_core_subnet" "subnet" {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + availability_domain        = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + cidr_block                 = "10.0.0.0/24"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + compartment_id             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + defined_tags               = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + dhcp_options_id            = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + display_name               = "MentoriaIaC-subnet"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + dns_label                  = "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + freeform_tags              = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + id                         = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + ipv6cidr_block             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + ipv6virtual_router_ip      = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + prohibit_internet_ingress  = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + prohibit_public_ip_on_vnic = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + route_table_id             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + security_list_ids          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + state                      = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + subnet_domain_name         = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + time_created               = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + vcn_id                     = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + virtual_router_ip          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + virtual_router_mac         = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   # module.groundwork.oci_core_vcn.vcn will be created
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + resource "oci_core_vcn" "vcn" {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + cidr_block               = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + cidr_blocks              = [
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:           + "10.0.0.0/16",
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:         ]
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + compartment_id           = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + default_dhcp_options_id  = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + default_route_table_id   = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + default_security_list_id = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + defined_tags             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + display_name             = "MentoriaIaC-vcn"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + dns_label                = "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + freeform_tags            = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + id                       = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + ipv6cidr_blocks          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + is_ipv6enabled           = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + state                    = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + time_created             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + vcn_domain_name          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   # module.groundwork.oci_identity_compartment.compartment will be created
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + resource "oci_identity_compartment" "compartment" {
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + compartment_id = (sensitive)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + defined_tags   = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + description    = "Compartment para guardar os recursos relativos a MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + freeform_tags  = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + id             = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + inactive_state = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + is_accessible  = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + name           = "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + state          = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + time_created   = (known after apply)
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: Plan: 5 to add, 0 to change, 0 to destroy.
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66: Changes to Outputs:
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + compartment_name = "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + subnet_cidr      = "10.0.0.0/24"
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:   + vcn_cidr         = [
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:       + "10.0.0.0/16",
TestGroundworkModule 2022-02-16T20:59:38-03:00 logger.go:66:     ]
TestGroundworkModule 2022-02-16T20:59:39-03:00 logger.go:66: module.groundwork.oci_identity_compartment.compartment: Creating...
TestGroundworkModule 2022-02-16T20:59:41-03:00 logger.go:66: module.groundwork.oci_identity_compartment.compartment: Creation complete after 2s [id=ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e]
TestGroundworkModule 2022-02-16T20:59:41-03:00 logger.go:66: module.groundwork.oci_core_vcn.vcn: Creating...
TestGroundworkModule 2022-02-16T20:59:42-03:00 logger.go:66: module.groundwork.oci_core_vcn.vcn: Creation complete after 2s [id=ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a]
TestGroundworkModule 2022-02-16T20:59:42-03:00 logger.go:66: module.groundwork.oci_core_internet_gateway.internet_gateway: Creating...
TestGroundworkModule 2022-02-16T20:59:42-03:00 logger.go:66: module.groundwork.oci_core_subnet.subnet: Creating...
TestGroundworkModule 2022-02-16T20:59:43-03:00 logger.go:66: module.groundwork.oci_core_internet_gateway.internet_gateway: Creation complete after 0s [id=ocid1.internetgateway.oc1.iad.aaaaaaaasb4y7akxz5ffnxiltpouggy6xbl2eimmndzarcwgpmk7e36bu3pa]
TestGroundworkModule 2022-02-16T20:59:43-03:00 logger.go:66: module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table: Creating...
TestGroundworkModule 2022-02-16T20:59:44-03:00 logger.go:66: module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table: Creation complete after 1s [id=ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq]
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: module.groundwork.oci_core_subnet.subnet: Creation complete after 5s [id=ocid1.subnet.oc1.iad.aaaaaaaalsq5hosi6obno56h3wyph25qnqgcyxairv6d4z2gpqwpyknu7kba]
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: Outputs:
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: compartment_name = "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: subnet_cidr = "10.0.0.0/24"
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: vcn_cidr = tolist([
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66:   "10.0.0.0/16",
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: ])
TestGroundworkModule 2022-02-16T20:59:47-03:00 retry.go:91: terraform [output -no-color -json vcn_cidr]
TestGroundworkModule 2022-02-16T20:59:47-03:00 logger.go:66: Running command terraform with args [output -no-color -json vcn_cidr]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: ["10.0.0.0/16"]
TestGroundworkModule 2022-02-16T20:59:48-03:00 retry.go:91: terraform [output -no-color -json subnet_cidr]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: Running command terraform with args [output -no-color -json subnet_cidr]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: "10.0.0.0/24"
TestGroundworkModule 2022-02-16T20:59:48-03:00 retry.go:91: terraform [output -no-color -json compartment_name]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: Running command terraform with args [output -no-color -json compartment_name]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: "MentoriaIaC"
TestGroundworkModule 2022-02-16T20:59:48-03:00 retry.go:91: terraform [destroy -auto-approve -input=false -lock=false]
TestGroundworkModule 2022-02-16T20:59:48-03:00 logger.go:66: Running command terraform with args [destroy -auto-approve -input=false -lock=false]
TestGroundworkModule 2022-02-16T20:59:51-03:00 logger.go:66: module.groundwork.oci_identity_compartment.compartment: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e]
TestGroundworkModule 2022-02-16T20:59:51-03:00 logger.go:66: module.groundwork.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a]
TestGroundworkModule 2022-02-16T20:59:52-03:00 logger.go:66: module.groundwork.oci_core_internet_gateway.internet_gateway: Refreshing state... [id=ocid1.internetgateway.oc1.iad.aaaaaaaasb4y7akxz5ffnxiltpouggy6xbl2eimmndzarcwgpmk7e36bu3pa]
TestGroundworkModule 2022-02-16T20:59:52-03:00 logger.go:66: module.groundwork.oci_core_subnet.subnet: Refreshing state... [id=ocid1.subnet.oc1.iad.aaaaaaaalsq5hosi6obno56h3wyph25qnqgcyxairv6d4z2gpqwpyknu7kba]
TestGroundworkModule 2022-02-16T20:59:52-03:00 logger.go:66: module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table: Refreshing state... [id=ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq]
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - destroy
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: Terraform will perform the following actions:
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: ****
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   # module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table will be destroyed
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - resource "oci_core_default_route_table" "generated_oci_core_default_route_table" {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - compartment_id             = "ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspj" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - defined_tags               = {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedBy" = "ramonboorges@gmail.com"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedOn" = "2022-02-16T23:59:41.740Z"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         } -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - display_name               = "pub-routetable-01" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - freeform_tags              = {} -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - id                         = "ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - manage_default_resource_id = "ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - state                      = "AVAILABLE" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - time_created               = "2022-02-16 23:59:41.858 +0000 UTC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - route_rules {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - description       = "Tráfedo de/para internet" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - destination       = "0.0.0.0/0" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - destination_type  = "CIDR_BLOCK" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - network_entity_id = "ocid1.internetgateway.oc1.iad.aaaaaaaasb4y7akxz5ffnxiltpouggy6xbl2eimmndzarcwgpmk7e36bu3pa" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   # module.groundwork.oci_core_internet_gateway.internet_gateway will be destroyed
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - resource "oci_core_internet_gateway" "internet_gateway" {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - compartment_id = "ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtp" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - defined_tags   = {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedBy" = "ramonboorges@gmail.com"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedOn" = "2022-02-16T23:59:42.916Z"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         } -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - display_name   = "MentoriaIaC-igw" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - enabled        = true -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - freeform_tags  = {} -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - id             = "ocid1.internetgateway.oc1.iad.aaaaaaaasb4y7akxz5ffnxiltpouggy6xbl2eimmndzarcwgpmk7e36bu3pa" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - state          = "AVAILABLE" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - time_created   = "2022-02-16 23:59:42.97 +0000 UTC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - vcn_id         = "ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   # module.groundwork.oci_core_subnet.subnet will be destroyed
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - resource "oci_core_subnet" "subnet" {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - cidr_block                 = "10.0.0.0/24" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - compartment_id             = "ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - defined_tags               = {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedBy" = "ramonboorges@gmail.com"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedOn" = "2022-02-16T23:59:43.394Z"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         } -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - dhcp_options_id            = "ocid1.dhcpoptions.oc1.iad.aaaaaaaamibefh5xkay2sutahbrssag64azp35zqodktwueo7airpg3xobza" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - display_name               = "MentoriaIaC-subnet" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - dns_label                  = "mentoriaiac" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - freeform_tags              = {} -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - id                         = "ocid1.subnet.oc1.iad.aaaaaaaalsq5hosi6obno56h3wyph25qnqgcyxairv6d4z2gpqwpyknu7kba" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - prohibit_internet_ingress  = false -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - prohibit_public_ip_on_vnic = false -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - route_table_id             = "ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - security_list_ids          = [
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "ocid1.securitylist.oc1.iad.aaaaaaaaak3zmofagk52ooiontdpvyd3mbj4z5zwuaxkuyssmkbwzr5ylwya",
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         ] -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - state                      = "AVAILABLE" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - subnet_domain_name         = "mentoriaiac.mentoriaiac.oraclevcn.com" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - time_created               = "2022-02-16 23:59:44.446 +0000 UTC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - vcn_id                     = "ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - virtual_router_ip          = "10.0.0.1" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - virtual_router_mac         = "00:00:17:8C:56:4C" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   # module.groundwork.oci_core_vcn.vcn will be destroyed
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - resource "oci_core_vcn" "vcn" {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - cidr_block               = "10.0.0.0/16" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - cidr_blocks              = [
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "10.0.0.0/16",
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         ] -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - compartment_id           = "ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - default_dhcp_options_id  = "ocid1.dhcpoptions.oc1.iad.aaaaaaaamibefh5xkay2sutahbrssag64azp35zqodktwueo7airpg3xobza" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - default_route_table_id   = "ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - default_security_list_id = "ocid1.securitylist.oc1.iad.aaaaaaaaak3zmofagk52ooiontdpvyd3mbj4z5zwuaxkuyssmkbwzr5ylwya" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - defined_tags             = {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedBy" = "ramonboorges@gmail.com"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedOn" = "2022-02-16T23:59:41.740Z"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         } -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - display_name             = "MentoriaIaC-vcn" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - dns_label                = "mentoriaiac" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - freeform_tags            = {} -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - id                       = "ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - ipv6cidr_blocks          = [] -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - is_ipv6enabled           = false -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - state                    = "AVAILABLE" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - time_created             = "2022-02-16 23:59:41.858 +0000 UTC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - vcn_domain_name          = "mentoriaiac.oraclevcn.com" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   # module.groundwork.oci_identity_compartment.compartment will be destroyed
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - resource "oci_identity_compartment" "compartment" {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - compartment_id = (sensitive) -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - defined_tags   = {
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedBy" = "ramonboorges@gmail.com"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:           - "Oracle-Tags.CreatedOn" = "2022-02-10T22:47:04.115Z"
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:         } -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - description    = "Compartment para guardar os recursos relativos a MentoriaIaC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - freeform_tags  = {} -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - id             = "ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - is_accessible  = true -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - name           = "MentoriaIaC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - state          = "ACTIVE" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - time_created   = "2022-02-10 22:47:04.281 +0000 UTC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     }
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: Plan: 0 to add, 0 to change, 5 to destroy.
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66: Changes to Outputs:
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - compartment_name = "MentoriaIaC" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - subnet_cidr      = "10.0.0.0/24" -> null
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:   - vcn_cidr         = [
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:       - "10.0.0.0/16",
TestGroundworkModule 2022-02-16T20:59:53-03:00 logger.go:66:     ] -> null
TestGroundworkModule 2022-02-16T20:59:54-03:00 logger.go:66: module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table: Destroying... [id=ocid1.routetable.oc1.iad.aaaaaaaaaew6kumwhqvykvmnvqd4tojvfcwsmponuhbbljb4vuzxlkixhloq]
TestGroundworkModule 2022-02-16T20:59:54-03:00 logger.go:66: module.groundwork.oci_core_subnet.subnet: Destroying... [id=ocid1.subnet.oc1.iad.aaaaaaaalsq5hosi6obno56h3wyph25qnqgcyxairv6d4z2gpqwpyknu7kba]
TestGroundworkModule 2022-02-16T20:59:55-03:00 logger.go:66: module.groundwork.oci_core_default_route_table.generated_oci_core_default_route_table: Destruction complete after 2s
TestGroundworkModule 2022-02-16T20:59:55-03:00 logger.go:66: module.groundwork.oci_core_internet_gateway.internet_gateway: Destroying... [id=ocid1.internetgateway.oc1.iad.aaaaaaaasb4y7akxz5ffnxiltpouggy6xbl2eimmndzarcwgpmk7e36bu3pa]
TestGroundworkModule 2022-02-16T20:59:56-03:00 logger.go:66: module.groundwork.oci_core_internet_gateway.internet_gateway: Destruction complete after 0s
TestGroundworkModule 2022-02-16T20:59:57-03:00 logger.go:66: module.groundwork.oci_core_subnet.subnet: Destruction complete after 4s
TestGroundworkModule 2022-02-16T20:59:57-03:00 logger.go:66: module.groundwork.oci_core_vcn.vcn: Destroying... [id=ocid1.vcn.oc1.iad.amaaaaaay7s62giaqlvkr7mutg4ok3gfjauqbohpl3sm54oq77repqrhat5a]
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: module.groundwork.oci_core_vcn.vcn: Destruction complete after 1s
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: module.groundwork.oci_identity_compartment.compartment: Destroying... [id=ocid1.compartment.oc1..aaaaaaaajtm6md4ryhhcspjtflp2y5nmqswtpqwmzsugsl3e]
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: module.groundwork.oci_identity_compartment.compartment: Destruction complete after 0s
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: 
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: Destroy complete! Resources: 5 destroyed.
TestGroundworkModule 2022-02-16T20:59:58-03:00 logger.go:66: 
--- PASS: TestGroundworkModule (23.30s)
PASS
ok  	mentoria	23.313s
```